## Plans :heavy_multiplication_x:

Running plans **FAILED**.  See **Terrateam Plan Output**.

After resolving the issue, run `terrateam plan` to execute the plan operation again.

<details>
  <summary><h2>Terrateam Plan Output :heavy_multiplication_x:</h2></summary>

<details>
  <summary><h3>Pre Hooks</h3></summary>

</details>

<details>
  <summary><h3>Post Hooks</h3></summary>

</details>

**Dir**: azure/modules/load_balancer
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: init
**Success**: :thumbsup:
```

Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/azurerm...
- Installing hashicorp/azurerm v3.48.0...
- Installed hashicorp/azurerm v3.48.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

```
**Step**: plan
**Success**: :heavy_multiplication_x:
```
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 1:
│    1: variable "resourceGroupName" {}
│ 
│ The root module input variable "resourceGroupName" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 2:
│    2: variable "location" {}
│ 
│ The root module input variable "location" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 3:
│    3: variable "loadbalancerIpName" {}
│ 
│ The root module input variable "loadbalancerIpName" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 4:
│    4: variable "loadbalancerName" {}
│ 
│ The root module input variable "loadbalancerName" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 5:
│    5: variable "httpPort" {}
│ 
│ The root module input variable "httpPort" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 6:
│    6: variable "additionalTags" {}
│ 
│ The root module input variable "additionalTags" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵

```
**Dir**: azure/modules/resource_group
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: init
**Success**: :thumbsup:
```

Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/azurerm...
- Installing hashicorp/azurerm v3.48.0...
- Installed hashicorp/azurerm v3.48.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

```
**Step**: plan
**Success**: :heavy_multiplication_x:
```
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 1:
│    1: variable "resourceGroupName" {}
│ 
│ The root module input variable "resourceGroupName" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 2:
│    2: variable "location" {}
│ 
│ The root module input variable "location" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 3:
│    3: variable "additionalTags" {}
│ 
│ The root module input variable "additionalTags" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵

```
**Dir**: azure/modules/service_bus
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: init
**Success**: :thumbsup:
```

Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/azurerm...
- Installing hashicorp/azurerm v3.48.0...
- Installed hashicorp/azurerm v3.48.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

```
**Step**: plan
**Success**: :heavy_multiplication_x:
```
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 1:
│    1: variable "resourceGroupName" {}
│ 
│ The root module input variable "resourceGroupName" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 2:
│    2: variable "location" {}
│ 
│ The root module input variable "location" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 3:
│    3: variable "additionalTags" {}
│ 
│ The root module input variable "additionalTags" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 4:
│    4: variable "servicebusNamespaceName" {}
│ 
│ The root module input variable "servicebusNamespaceName" is not set, and
│ has no default value. Use a -var or -var-file command line argument to
│ provide a value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 5:
│    5: variable "servicebusNamespaceSku" {}
│ 
│ The root module input variable "servicebusNamespaceSku" is not set, and has
│ no default value. Use a -var or -var-file command line argument to provide
│ a value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 6:
│    6: variable "serviceBusQueueName" {}
│ 
│ The root module input variable "serviceBusQueueName" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵

```
**Dir**: azure/modules/ssh_key
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: init
**Success**: :thumbsup:
```

Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/tls...
- Finding latest version of hashicorp/azurerm...
- Installing hashicorp/tls v4.0.4...
- Installed hashicorp/tls v4.0.4 (signed by HashiCorp)
- Installing hashicorp/azurerm v3.48.0...
- Installed hashicorp/azurerm v3.48.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

```
**Step**: plan
**Success**: :heavy_multiplication_x:
```
╷
│ Error: No value for required variable
│ 
│   on variable.tf line 1:
│    1: variable "keyVaultName" {}
│ 
│ The root module input variable "keyVaultName" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variable.tf line 2:
│    2: variable "keyVaulResourceGroup" {}
│ 
│ The root module input variable "keyVaulResourceGroup" is not set, and has
│ no default value. Use a -var or -var-file command line argument to provide
│ a value for this variable.
╵

```
**Dir**: azure/modules/vmss
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: init
**Success**: :thumbsup:
```

Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/azurerm...
- Installing hashicorp/azurerm v3.48.0...
- Installed hashicorp/azurerm v3.48.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

```
**Step**: plan
**Success**: :heavy_multiplication_x:
```
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 1:
│    1: variable "vmssName" {}
│ 
│ The root module input variable "vmssName" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 2:
│    2: variable "resourceGroupName" {}
│ 
│ The root module input variable "resourceGroupName" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 3:
│    3: variable "location" {}
│ 
│ The root module input variable "location" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 4:
│    4: variable "additionalTags" {}
│ 
│ The root module input variable "additionalTags" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 5:
│    5: variable "vmssSku" {}
│ 
│ The root module input variable "vmssSku" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 6:
│    6: variable "vmssInstanceCount" {}
│ 
│ The root module input variable "vmssInstanceCount" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 7:
│    7: variable "image" {}
│ 
│ The root module input variable "image" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 8:
│    8: variable "disk" {}
│ 
│ The root module input variable "disk" is not set, and has no default value.
│ Use a -var or -var-file command line argument to provide a value for this
│ variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 9:
│    9: variable "subnet_id" {}
│ 
│ The root module input variable "subnet_id" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 10:
│   10: variable "public_key" {}
│ 
│ The root module input variable "public_key" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 11:
│   11: variable "backend_address_pool_id" {}
│ 
│ The root module input variable "backend_address_pool_id" is not set, and
│ has no default value. Use a -var or -var-file command line argument to
│ provide a value for this variable.
╵

```
**Dir**: azure
**Workspace**: dev
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # module.loadbalancer.azurerm_lb.vmss_lb will be created
+   resource "azurerm_lb" "vmss_lb" {
+       id                   = (known after apply)
+       location             = "australiaeast"
+       name                 = "dev-lb-01"
+       private_ip_address   = (known after apply)
+       private_ip_addresses = (known after apply)
+       resource_group_name  = "terrateam-dev-rg"
+       sku                  = "Basic"
+       sku_tier             = "Regional"
+       tags                 = {
+           "Environment" = "Dev"
+           "Name"        = "TerrateamTesting"
        }

+       frontend_ip_configuration {
+           gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
+           id                                                 = (known after apply)
+           inbound_nat_rules                                  = (known after apply)
+           load_balancer_rules                                = (known after apply)
+           name                                               = "PublicIPAddress"
+           outbound_rules                                     = (known after apply)
+           private_ip_address                                 = (known after apply)
+           private_ip_address_allocation                      = (known after apply)
+           private_ip_address_version                         = (known after apply)
+           public_ip_address_id                               = (known after apply)
+           public_ip_prefix_id                                = (known after apply)
+           subnet_id                                          = (known after apply)
        }
    }

  # module.loadbalancer.azurerm_lb_backend_address_pool.vmss_bepool will be created
+   resource "azurerm_lb_backend_address_pool" "vmss_bepool" {
+       backend_ip_configurations = (known after apply)
+       id                        = (known after apply)
+       inbound_nat_rules         = (known after apply)
+       load_balancing_rules      = (known after apply)
+       loadbalancer_id           = (known after apply)
+       name                      = "BackEndAddressPool"
+       outbound_rules            = (known after apply)
    }

  # module.loadbalancer.azurerm_lb_probe.vmss_probe will be created
+   resource "azurerm_lb_probe" "vmss_probe" {
+       id                  = (known after apply)
+       interval_in_seconds = 15
+       load_balancer_rules = (known after apply)
+       loadbalancer_id     = (known after apply)
+       name                = "website-probe"
+       number_of_probes    = 2
+       port                = 3000
+       probe_threshold     = 1
+       protocol            = (known after apply)
    }

  # module.loadbalancer.azurerm_lb_rule.vmss_lb_rule will be created
+   resource "azurerm_lb_rule" "vmss_lb_rule" {
+       backend_port                   = 3000
+       disable_outbound_snat          = false
+       enable_floating_ip             = false
+       frontend_ip_configuration_id   = (known after apply)
+       frontend_ip_configuration_name = "PublicIPAddress"
+       frontend_port                  = 3000
+       id                             = (known after apply)
+       idle_timeout_in_minutes        = (known after apply)
+       load_distribution              = (known after apply)
+       loadbalancer_id                = (known after apply)
+       name                           = "http"
+       probe_id                       = (known after apply)
+       protocol                       = "Tcp"
    }

  # module.loadbalancer.azurerm_public_ip.vmss_lb_pip will be created
+   resource "azurerm_public_ip" "vmss_lb_pip" {
+       allocation_method       = "Static"
+       ddos_protection_mode    = "VirtualNetworkInherited"
+       fqdn                    = (known after apply)
+       id                      = (known after apply)
+       idle_timeout_in_minutes = 4
+       ip_address              = (known after apply)
+       ip_version              = "IPv4"
+       location                = "australiaeast"
+       name                    = "dev-lbpip-01"
+       resource_group_name     = "terrateam-dev-rg"
+       sku                     = "Basic"
+       sku_tier                = "Regional"
+       tags                    = {
+           "Environment" = "Dev"
+           "Name"        = "TerrateamTesting"
        }
    }

  # module.resource_group.azurerm_resource_group.rg will be created
+   resource "azurerm_resource_group" "rg" {
+       id       = (known after apply)
+       location = "australiaeast"
+       name     = "terrateam-dev-rg"
+       tags     = {
+           "Environment" = "Dev"
+           "Name"        = "TerrateamTesting"
        }
    }

  # module.servicebus.azurerm_servicebus_namespace.service_bus will be created
+   resource "azurerm_servicebus_namespace" "service_bus" {
+       capacity                            = 0
+       default_primary_connection_string   = (sensitive value)
+       default_primary_key                 = (sensitive value)
+       default_secondary_connection_string = (sensitive value)
+       default_secondary_key               = (sensitive value)
+       id                                  = (known after apply)
+       local_auth_enabled                  = true
+       location                            = "australiaeast"
+       minimum_tls_version                 = (known after apply)
+       name                                = "dev-servicebus-01"
+       public_network_access_enabled       = true
+       resource_group_name                 = "terrateam-dev-rg"
+       sku                                 = "Standard"
+       tags                                = {
+           "Environment" = "Dev"
+           "Name"        = "TerrateamTesting"
        }
    }

  # module.servicebus.azurerm_servicebus_queue.service_bus_queue["inputQueue01"] will be created
+   resource "azurerm_servicebus_queue" "service_bus_queue" {
+       auto_delete_on_idle                     = (known after apply)
+       dead_lettering_on_message_expiration    = true
+       default_message_ttl                     = (known after apply)
+       duplicate_detection_history_time_window = (known after apply)
+       enable_batched_operations               = true
+       enable_express                          = false
+       enable_partitioning                     = true
+       forward_dead_lettered_messages_to       = "inputQueue01-dlq"
+       id                                      = (known after apply)
+       lock_duration                           = (known after apply)
+       max_delivery_count                      = 10
+       max_message_size_in_kilobytes           = (known after apply)
+       max_size_in_megabytes                   = (known after apply)
+       name                                    = "inputQueue01"
+       namespace_id                            = (known after apply)
+       requires_duplicate_detection            = false
+       requires_session                        = false
+       status                                  = "Active"
    }

  # module.servicebus.azurerm_servicebus_queue.service_bus_queue["inputQueue02"] will be created
+   resource "azurerm_servicebus_queue" "service_bus_queue" {
+       auto_delete_on_idle                     = (known after apply)
+       dead_lettering_on_message_expiration    = true
+       default_message_ttl                     = (known after apply)
+       duplicate_detection_history_time_window = (known after apply)
+       enable_batched_operations               = true
+       enable_express                          = false
+       enable_partitioning                     = true
+       forward_dead_lettered_messages_to       = "inputQueue02-dlq"
+       id                                      = (known after apply)
+       lock_duration                           = (known after apply)
+       max_delivery_count                      = 10
+       max_message_size_in_kilobytes           = (known after apply)
+       max_size_in_megabytes                   = (known after apply)
+       name                                    = "inputQueue02"
+       namespace_id                            = (known after apply)
+       requires_duplicate_detection            = false
+       requires_session                        = false
+       status                                  = "Active"
    }

  # module.servicebus.azurerm_servicebus_queue.service_bus_queue["outputQueue01"] will be created
+   resource "azurerm_servicebus_queue" "service_bus_queue" {
+       auto_delete_on_idle                     = (known after apply)
+       dead_lettering_on_message_expiration    = true
+       default_message_ttl                     = (known after apply)
+       duplicate_detection_history_time_window = (known after apply)
+       enable_batched_operations               = true
+       enable_express                          = false
+       enable_partitioning                     = true
+       forward_dead_lettered_messages_to       = "outputQueue01-dlq"
+       id                                      = (known after apply)
+       lock_duration                           = (known after apply)
+       max_delivery_count                      = 10
+       max_message_size_in_kilobytes           = (known after apply)
+       max_size_in_megabytes                   = (known after apply)
+       name                                    = "outputQueue01"
+       namespace_id                            = (known after apply)
+       requires_duplicate_detection            = false
+       requires_session                        = false
+       status                                  = "Active"
    }

  # module.servicebus.azurerm_servicebus_queue.service_bus_queue["outputQueue02"] will be created
+   resource "azurerm_servicebus_queue" "service_bus_queue" {
+       auto_delete_on_idle                     = (known after apply)
+       dead_lettering_on_message_expiration    = true
+       default_message_ttl                     = (known after apply)
+       duplicate_detection_history_time_window = (known after apply)
+       enable_batched_operations               = true
+       enable_express                          = false
+       enable_partitioning                     = true
+       forward_dead_lettered_messages_to       = "outputQueue02-dlq"
+       id                                      = (known after apply)
+       lock_duration                           = (known after apply)
+       max_delivery_count                      = 10
+       max_message_size_in_kilobytes           = (known after apply)
+       max_size_in_megabytes                   = (known after apply)
+       name                                    = "outputQueue02"
+       namespace_id                            = (known after apply)
+       requires_duplicate_detection            = false
+       requires_session                        = false
+       status                                  = "Active"
    }

  # module.servicebus.azurerm_servicebus_queue_authorization_rule.service_bus_auth_rule["inputQueue01"] will be created
+   resource "azurerm_servicebus_queue_authorization_rule" "service_bus_auth_rule" {
+       id                                = (known after apply)
+       listen                            = true
+       manage                            = false
+       name                              = "inputQueue01-authRule"
+       primary_connection_string         = (sensitive value)
+       primary_connection_string_alias   = (sensitive value)
+       primary_key                       = (sensitive value)
+       queue_id                          = (known after apply)
+       secondary_connection_string       = (sensitive value)
+       secondary_connection_string_alias = (sensitive value)
+       secondary_key                     = (sensitive value)
+       send                              = false
    }

  # module.servicebus.azurerm_servicebus_queue_authorization_rule.service_bus_auth_rule["inputQueue02"] will be created
+   resource "azurerm_servicebus_queue_authorization_rule" "service_bus_auth_rule" {
+       id                                = (known after apply)
+       listen                            = true
+       manage                            = false
+       name                              = "inputQueue02-authRule"
+       primary_connection_string         = (sensitive value)
+       primary_connection_string_alias   = (sensitive value)
+       primary_key                       = (sensitive value)
+       queue_id                          = (known after apply)
+       secondary_connection_string       = (sensitive value)
+       secondary_connection_string_alias = (sensitive value)
+       secondary_key                     = (sensitive value)
+       send                              = false
    }

  # module.servicebus.azurerm_servicebus_queue_authorization_rule.service_bus_auth_rule["outputQueue01"] will be created
+   resource "azurerm_servicebus_queue_authorization_rule" "service_bus_auth_rule" {
+       id                                = (known after apply)
+       listen                            = false
+       manage                            = false
+       name                              = "outputQueue01-authRule"
+       primary_connection_string         = (sensitive value)
+       primary_connection_string_alias   = (sensitive value)
+       primary_key                       = (sensitive value)
+       queue_id                          = (known after apply)
+       secondary_connection_string       = (sensitive value)
+       secondary_connection_string_alias = (sensitive value)
+       secondary_key                     = (sensitive value)
+       send                              = true
    }

  # module.servicebus.azurerm_servicebus_queue_authorization_rule.service_bus_auth_rule["outputQueue02"] will be created
+   resource "azurerm_servicebus_queue_authorization_rule" "service_bus_auth_rule" {
+       id                                = (known after apply)
+       listen                            = false
+       manage                            = false
+       name                              = "outputQueue02-authRule"
+       primary_connection_string         = (sensitive value)
+       primary_connection_string_alias   = (sensitive value)
+       primary_key                       = (sensitive value)
+       queue_id                          = (known after apply)
+       secondary_connection_string       = (sensitive value)
+       secondary_connection_string_alias = (sensitive value)
+       secondary_key                     = (sensitive value)
+       send                              = true
    }

  # module.sshkey.azurerm_key_vault_secret.privatekey will be created
+   resource "azurerm_key_vault_secret" "privatekey" {
+       id                      = (known after apply)
+       key_vault_id            = "/subscriptions/c0a7411f-f271-46c5-b183-2403fbc3b328/resourceGroups/tfstate/providers/Microsoft.KeyVault/vaults/tf-core-backend-kv469"
+       name                    = "private-key"
+       resource_id             = (known after apply)
+       resource_versionless_id = (known after apply)
+       value                   = (sensitive value)
+       version                 = (known after apply)
+       versionless_id          = (known after apply)
    }

  # module.sshkey.tls_private_key.vmss_ssh_key will be created
+   resource "tls_private_key" "vmss_ssh_key" {
+       algorithm                     = "RSA"
+       ecdsa_curve                   = "P224"
+       id                            = (known after apply)
+       private_key_openssh           = (sensitive value)
+       private_key_pem               = (sensitive value)
+       private_key_pem_pkcs8         = (sensitive value)
+       public_key_fingerprint_md5    = (known after apply)
+       public_key_fingerprint_sha256 = (known after apply)
+       public_key_openssh            = (known after apply)
+       public_key_pem                = (known after apply)
+       rsa_bits                      = 4096
    }

  # module.state_storage.azurerm_storage_account.tfstate will be updated in-place
!   resource "azurerm_storage_account" "tfstate" {
+       cross_tenant_replication_enabled  = true
        id                                = "/subscriptions/c0a7411f-f271-46c5-b183-2403fbc3b328/resourceGroups/tfstate/providers/Microsoft.Storage/storageAccounts/tfstatep6cue"
        name                              = "tfstatep6cue"
!       tags                              = {
!           "environment" = "staging" -> "Dev"
        }
        # (36 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.subnet.azurerm_subnet.subnet will be created
+   resource "azurerm_subnet" "subnet" {
+       address_prefixes                               = [
+           "10.0.1.0/24",
        ]
+       enforce_private_link_endpoint_network_policies = (known after apply)
+       enforce_private_link_service_network_policies  = (known after apply)
+       id                                             = (known after apply)
+       name                                           = "dev-subnet-01"
+       private_endpoint_network_policies_enabled      = (known after apply)
+       private_link_service_network_policies_enabled  = (known after apply)
+       resource_group_name                            = "terrateam-dev-rg"
+       virtual_network_name                           = (known after apply)
    }

  # module.virtual_network.azurerm_virtual_network.vnet will be created
+   resource "azurerm_virtual_network" "vnet" {
+       address_space       = [
+           "10.0.0.0/16",
        ]
+       dns_servers         = (known after apply)
+       guid                = (known after apply)
+       id                  = (known after apply)
+       location            = "australiaeast"
+       name                = "dev-vnet-01"
+       resource_group_name = "terrateam-dev-rg"
+       subnet              = (known after apply)
+       tags                = {
+           "Environment" = "Dev"
+           "Name"        = "TerrateamTesting"
        }
    }

  # module.vmss.azurerm_linux_virtual_machine_scale_set.vmss_01 will be created
+   resource "azurerm_linux_virtual_machine_scale_set" "vmss_01" {
+       admin_username                                    = "adminuser"
+       computer_name_prefix                              = (known after apply)
+       disable_password_authentication                   = true
+       do_not_run_extensions_on_overprovisioned_machines = false
+       extension_operations_enabled                      = (known after apply)
+       extensions_time_budget                            = "PT1H30M"
+       id                                                = (known after apply)
+       instances                                         = 3
+       location                                          = "australiaeast"
+       max_bid_price                                     = -1
+       name                                              = "dev-vmss-01"
+       overprovision                                     = true
+       platform_fault_domain_count                       = (known after apply)
+       priority                                          = "Regular"
+       provision_vm_agent                                = true
+       resource_group_name                               = "terrateam-dev-rg"
+       scale_in_policy                                   = (known after apply)
+       single_placement_group                            = true
+       sku                                               = "Standard_F2"
+       tags                                              = {
+           "Environment" = "Dev"
+           "Name"        = "TerrateamTesting"
        }
+       unique_id                                         = (known after apply)
+       upgrade_mode                                      = "Manual"
+       zone_balance                                      = false

+       admin_ssh_key {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

+       automatic_instance_repair {
+           enabled      = (known after apply)
+           grace_period = (known after apply)
        }

+       extension {
+           auto_upgrade_minor_version = (known after apply)
+           automatic_upgrade_enabled  = (known after apply)
+           force_update_tag           = (known after apply)
+           name                       = (known after apply)
+           protected_settings         = (sensitive value)
+           provision_after_extensions = (known after apply)
+           publisher                  = (known after apply)
+           settings                   = (known after apply)
+           type                       = (known after apply)
+           type_handler_version       = (known after apply)

+           protected_settings_from_key_vault {
+               secret_url      = (known after apply)
+               source_vault_id = (known after apply)
            }
        }

+       gallery_application {
+           configuration_blob_uri = (known after apply)
+           order                  = (known after apply)
+           tag                    = (known after apply)
+           version_id             = (known after apply)
        }

+       gallery_applications {
+           configuration_reference_blob_uri = (known after apply)
+           order                            = (known after apply)
+           package_reference_id             = (known after apply)
+           tag                              = (known after apply)
        }

+       network_interface {
+           enable_accelerated_networking = false
+           enable_ip_forwarding          = false
+           name                          = "example"
+           primary                       = true

+           ip_configuration {
+               load_balancer_backend_address_pool_ids = (known after apply)
+               name                                   = "internal"
+               primary                                = true
+               subnet_id                              = (known after apply)
+               version                                = "IPv4"
            }
        }

+       os_disk {
+           caching                   = "ReadWrite"
+           disk_size_gb              = (known after apply)
+           storage_account_type      = "Standard_LRS"
+           write_accelerator_enabled = false
        }

+       scale_in {
+           force_deletion_enabled = (known after apply)
+           rule                   = (known after apply)
        }

+       source_image_reference {
+           offer     = "UbuntuServer"
+           publisher = "Canonical"
+           sku       = "22.04-LTS"
+           version   = "latest"
        }

+       spot_restore {
+           enabled = (known after apply)
+           timeout = (known after apply)
        }

+       terminate_notification {
+           enabled = (known after apply)
+           timeout = (known after apply)
        }

+       termination_notification {
+           enabled = (known after apply)
+           timeout = (known after apply)
        }
    }

  # module.vmss.azurerm_monitor_autoscale_setting.vmss_autoscale will be created
+   resource "azurerm_monitor_autoscale_setting" "vmss_autoscale" {
+       enabled             = true
+       id                  = (known after apply)
+       location            = "australiaeast"
+       name                = "myAutoscaleSetting"
+       resource_group_name = "terrateam-dev-rg"
+       target_resource_id  = (known after apply)

+       notification {
+           email {
+               custom_emails                         = [
+                   "admin@contoso.com",
                ]
+               send_to_subscription_administrator    = true
+               send_to_subscription_co_administrator = true
            }
        }

+       profile {
+           name = "defaultProfile"

+           capacity {
+               default = 3
+               maximum = 10
+               minimum = 3
            }

+           rule {
+               metric_trigger {
+                   metric_name        = "Percentage CPU"
+                   metric_namespace   = "microsoft.compute/virtualmachinescalesets"
+                   metric_resource_id = (known after apply)
+                   operator           = "GreaterThan"
+                   statistic          = "Average"
+                   threshold          = 75
+                   time_aggregation   = "Average"
+                   time_grain         = "PT1M"
+                   time_window        = "PT5M"

+                   dimensions {
+                       name     = "AppName"
+                       operator = "Equals"
+                       values   = [
+                           "App1",
                        ]
                    }
                }

+               scale_action {
+                   cooldown  = "PT1M"
+                   direction = "Increase"
+                   type      = "ChangeCount"
+                   value     = 1
                }
            }
+           rule {
+               metric_trigger {
+                   metric_name        = "Percentage CPU"
+                   metric_resource_id = (known after apply)
+                   operator           = "LessThan"
+                   statistic          = "Average"
+                   threshold          = 25
+                   time_aggregation   = "Average"
+                   time_grain         = "PT1M"
+                   time_window        = "PT5M"
                }

+               scale_action {
+                   cooldown  = "PT1M"
+                   direction = "Decrease"
+                   type      = "ChangeCount"
+                   value     = 1
                }
            }
        }
    }

  # module.vmss.azurerm_virtual_machine_scale_set_extension.vmss-extension will be created
+   resource "azurerm_virtual_machine_scale_set_extension" "vmss-extension" {
+       auto_upgrade_minor_version   = true
+       failure_suppression_enabled  = false
+       id                           = (known after apply)
+       name                         = "vmss-extension"
+       publisher                    = "Microsoft.Azure.Extensions"
+       settings                     = jsonencode(
            {
+               commandToExecute = "sh startup.sh"
+               fileUris         = [
+                   "https://tfstatep6cue.blob.core.windows.net/devscripts/startup.sh",
                ]
            }
        )
+       type                         = "CustomScript"
+       type_handler_version         = "2.0"
+       virtual_machine_scale_set_id = (known after apply)
    }

Plan: 22 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:azure workspace:dev
```

</details>


</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
